[
  {
    "timestamp": "2025-12-15T00:00:00-08:00",
    "session_id": "unity-fastlane-ci",
    "input": "Reorganize DebugUI scripts without breaking prefab/Inspector refs; verify sample pattern (Samples~) and check Assets/Samples symlink integrity.",
    "output": "Moved DebugUI scripts into Core/Controllers/Components/Mode/Utility while keeping .meta GUIDs; enumerated prefab m_Script GUIDs and confirmed custom scripts come from DebugUI folder (rest are Unity built-ins); validated Assets/Samples/com.sorolla.sdk/2.1.0/DebugUI is a symlink to Packages/com.sorolla.sdk/Samples~/DebugUI with a folder .meta present.",
    "insights": "Unity prefab references depend on meta GUIDs; moving .cs + .meta together preserves references. For Samples~, keep prefab-referenced scripts inside the sample folder to avoid GUID mismatch on import. Assets/Samples entries can be symlinks to Packages/.../Samples~; ensure the symlink exists and has a stable .meta next to it. If compilation errors mention missing old paths, csproj can be stale until Unity regenerates/reimports."
  },
  {
    "timestamp": "2025-12-15T13:45:00+01:00",
    "session_id": "unity-fastlane-ci",
    "input": "Add optional refresh button to IdentityCardController for async identities like ADID",
    "output": "Added serialized refreshButton field, wired in Awake/OnDestroy with null check, added Refresh() method that shows 'Fetching...' and calls AutoPopulate()",
    "insights": "Optional UI elements should use null-check pattern (if (button) button.onClick...) to avoid NRE when not assigned. ADID belongs in IdentityCardController (SRP), not duplicated in AdjustCardController."
  },
  {
    "timestamp": "2025-12-15T13:50:00+01:00",
    "session_id": "unity-fastlane-ci",
    "input": "Refactor: use bool toggle for refresh button visibility instead of null-check; remove ADID from AdjustCardController",
    "output": "IdentityCardController now uses showRefreshButton bool + SetActive() in Start(). AdjustCardController stripped of ADID logic (adidText, refreshAdidButton, RefreshAdid()). ADID now handled by IdentityCardController with identityType=AdjustId.",
    "insights": "Strict no null-check pattern: always reference UI elements, use bool to toggle visibility via SetActive(). SRP: split identity display (IdentityCardController) from SDK actions (AdjustCardController)."
  },
  {
    "timestamp": "2025-12-15T14:36:00+01:00",
    "session_id": "unity-fastlane-ci",
    "input": "Fix Android ClassNotFoundException: com.unity3d.player.appui.AppUIGameActivity on launch",
    "output": "Changed AndroidManifest.xml activity from AppUIGameActivity to UnityPlayerGameActivity. Removed stale com.unity.dt.app-ui reference from EditorBuildSettings.asset.",
    "insights": "App UI package (com.unity.dt.app-ui) reference in EditorBuildSettings can cause Unity to generate wrong activity class in manifest. If not using App UI, ensure manifest uses UnityPlayerGameActivity (Unity 6 GameActivity backend) or UnityPlayerActivity (legacy). Check EditorBuildSettings.m_configObjects for stale package refs."
  },
  {
    "timestamp": "2025-12-15T16:03:00+01:00",
    "session_id": "unity-fastlane-ci",
    "input": "Fix Adjust warnings: 'SDK needs to be initialized' (race condition) and double 'SANDBOX' warning (native log)",
    "output": "Added `yield return new WaitForSeconds(0.5f)` to IdentityCardController before fetching Adjust ID to allow native SDK initialization. Confirmed double 'SANDBOX' warning is benign native log duplication (Sorolla init runs only once). Fixed missing SOROLLA_ADJUST_ENABLED in DebugUI via new Sorolla.DebugUI.asmdef.",
    "insights": "Fetching native SDK values (ADID) immediately in Start() can fail due to async initialization (Max -> Adjust); always add delay or wait for IsInitialized signal. DebugUI scripts in Samples~ need their own .asmdef with versionDefines to access SDK-dependent code (#if SOROLLA_ADJUST_ENABLED). Native Android SDKs may log twice (one for config, one for start); verify code execution count before assuming double-init bug."
  },
  {
    "timestamp": "2025-12-15T16:39:00+01:00",
    "session_id": "unity-fastlane-ci",
    "input": "Implement proper GetAdvertisingId for Android; user reported nothing happens; tried implementing native JNI wrapper.",
    "output": "Initially implemented Application.RequestAdvertisingIdentifierAsync (Unity API hangs). Switched to custom Native JNI wrapper (AdvertisingIdFetcher). User pointed out Adjust SDK documentation. Replaced custom JNI with existing Adjust.GetGoogleAdId() (via AdjustAdapter). Deleted custom fetcher.",
    "insights": "CRITICAL: Before implementing complex native wrappers (JNI/Obj-C) for standard features (like Advertising ID), ALWAYS check if installed 3rd party SDKs (Adjust, Max, Firebase) already expose this functionality. Reinventing the wheel introduces maintenance burden and potential bugs. Trust the SDK's implementation over custom code unless proven broken."
  },
  {
    "timestamp": "2025-12-15T18:14:00+01:00",
    "session_id": "092f40e5-e8db-436d-a9b6-c535b867776a",
    "input": "Fix Debug UI docs (incorrect menu item) and make Debug UI easy to drag-and-drop (prefab w/o dependencies).",
    "output": "Updated README with Sample Import steps. Updated DebugPanelManager to auto-spawn EventSystem. Instructed user to create prefab from scene.",
    "insights": "User prioritizes drag-and-drop ease and accuracy in docs. Wants self-contained prefabs."
  },
  {
    "timestamp": "2025-12-16T10:36:00+01:00",
    "session_id": "unity-fastlane-ci",
    "input": "Setup iOS build target and resolve Ruby/CocoaPods errors.",
    "output": "Installed CocoaPods via Homebrew. Fixed iOS Resolver using system Ruby by toggling build targets (forced env reload).",
    "insights": "Unity iOS Resolver defaults to system Ruby (2.6) which fails on modern macOS. Fix: Install CocoaPods via Homebrew. Switch Platform (iOS->Android->iOS) forces Unity to pick up new PATH."
  },
  {
    "timestamp": "2025-12-16T10:45:00+01:00",
    "session_id": "unity-fastlane-ci",
    "input": "Fix iOS ATT silent fail in Unity Editor.",
    "output": "Modified ContextScreenView.cs to exclude UNITY_EDITOR from native iOS block. Verified Code path now uses FakeATTDialog.",
    "insights": "UNITY_IOS definition includes Editor when Target Platform is iOS. Must check !UNITY_EDITOR before calling native bindings."
  },
  {
    "timestamp": "2025-12-16T11:15:00+01:00",
    "session_id": "unity-fastlane-ci",
    "input": "Fix iOS ATT looping flow in Unity Editor.",
    "output": "Modified SorollaBootstrapper.cs to prioritize UNITY_EDITOR check in Initialize(). This ensures ShowContextAndRequestEditor() runs in Editor even when Target=iOS, avoiding the native polling loop.",
    "insights": "UNITY_IOS is defined in Editor if Target=iOS. Always use #if UNITY_EDITOR first to separate Editor simulation logic from actual device logic which may rely on native bindings."
  },
  {
    "timestamp": "2025-12-16T14:38:00+01:00",
    "session_id": "unity-fastlane-ci",
    "input": "Fix Debug UI showing Prototype mode when SDK is in Full mode on device.",
    "output": "Added Sorolla.OnInitialized event. Fixed ModeComponentBase, SDKHealthIndicator, IdentityCardController to use observer pattern instead of checking Sorolla.Config/IsInitialized in Start() before init completes.",
    "insights": "Components checking Sorolla.Config in Start() may run before Initialize() completes, causing null Config. Use observer pattern: subscribe to Sorolla.OnInitialized if not yet initialized, unsubscribe in OnDestroy. USER PREFERENCE: When subscribing a method to an event, subscribe the target method directly (e.g., Sorolla.OnInitialized += CheckSDKStatus) instead of creating a wrapper method that just calls it—avoid wasting lines."
  }
]
